#   *** Переменнные, фунцкции input() , типы данных, операции  ***

#PEP8

# Операция ввода данных
#in_1=input ("Введите первое число")
#in_2=input ("Введите второе число")


# result = in_1 + in_2 # конкатенация 

#result = int (in_1) + int(in_2) # сложение


#print (result)

# Типы данных 

# целочисленные данные
int_var = 777 

# тип данных "числа с плавающей точкой
float_var = 3,14 

# cтроковой тип данных 
str_var = "Hello World!"
char_var = "A" #символ

# булевы типы данных (Джордж Буль)
boolean_t = True #истина (логический 1)
boolean_f = False #ложь (логический 0)


# Способ форматирования строк f-string 
name = "germancheg"
age = 22

s = f"Имя: {name} Возраст: {age}"

#print(s)


# Арифметические операции
x = 5
y = 7 

#Сложение 
res = x + y 

# Вычитание
res = x - y

#Умножение 
res = x * y 

#Деление 
res = x / y 

# Целочисленное деление 
res = x // y 

# Деление с остатком 
res = x % y

#Возведение в степень 
res = x ** y 

print(res)